Revit 2027 API
BaseImportOptions.Unit Property
 The unit of measure for imported geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImportUnit Unit { get; set; }
Public Property Unit As ImportUnit
	Get
	Set
public:
property ImportUnit Unit {
	ImportUnit get ();
	void set (ImportUnit value);
}
member Unit : ImportUnit with get, set
Property Value
ImportUnit
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Units are used to calculate the import scale unless scale is defined explicitly using CustomScale, in which case Units will be ignored. Feet, inches, meters, centimeters, decimeters, millimeters are all supported. If Default unit is set, Revit will read and use the units from the file. If units are not available or accessible there, or if the file contains multiple length units, the data will be imported at the original scale regardless of the unit and default length unit options.
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace